In [1]:
! pip install pandas

Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (0.23.4)
Requirement already satisfied: python-dateutil>=2.5.0 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.7.5)
Requirement already satisfied: pytz>=2011k in c:\programdata\anaconda3\lib\site-packages (from pandas) (2018.7)
Requirement already satisfied: numpy>=1.9.0 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.15.4)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.5.0->pandas) (1.12.0)

In [2]:
import pandas as pd

Pandas:
---------------
- Pandas is a built-in library used for data analysis
- Pandas are heavily used for data manipulation, visualization, building machine learning models etc
- Pandas implements a no of powerful data operations familiar to users of both databas frameworks and spreadsheet programs
- There are two Data structure in pandas
    - Series
        - A series is similar to 1-D  numpy array, and contains values of the same type(numeric,string,datetime etc)
        - A DataFrame is simply a table where each column is a pandas series
        - Creating Series includes all python data structures - list, tuple, Dictionary,Numpy,Date_Range
    - DataFrame
        - The default way to store data is dataframes and thus manipulating data frames quickly is possible for data analysis

In [4]:
li = [156,52,33,74,15]
s1 = pd.Series(li)
s1

0    156
1     52
2     33
3     74
4     15
dtype: int64

In [5]:
s1.index = ["a",7,"bc","z",24]

In [6]:
s1

a     156
7      52
bc     33
z      74
24     15
dtype: int64

In [8]:
import numpy as np
s1.index = np.arange(15,20)
s1

15    156
16     52
17     33
18     74
19     15
dtype: int64

In [14]:
s1[17]

33

In [15]:
s1[15:18:2]

Series([], dtype: int64)

In [17]:
s2 = pd.Series("Python",index = [1,3,45,67,"a","d",26])
s2

1     Python
3     Python
45    Python
67    Python
a     Python
d     Python
26    Python
dtype: object

In [19]:
s = pd.Series([x**3 for x in range(11)])
s

0        0
1        1
2        8
3       27
4       64
5      125
6      216
7      343
8      512
9      729
10    1000
dtype: int64

In [20]:
s2 = pd.Series(np.square(np.arange(11)))
s2

0       0
1       1
2       4
3       9
4      16
5      25
6      36
7      49
8      64
9      81
10    100
dtype: int32

In [21]:
dt = pd.date_range(start = "2021-09-17",end = "2021-09-21")
dt

DatetimeIndex(['2021-09-17', '2021-09-18', '2021-09-19', '2021-09-20',
               '2021-09-21'],
              dtype='datetime64[ns]', freq='D')

In [22]:
import calendar,datetime,time

In [23]:
n = np.arange(10)
s3 = pd.Series(n,index = np.arange(20,30))
s3

20    0
21    1
22    2
23    3
24    4
25    5
26    6
27    7
28    8
29    9
dtype: int32

In [25]:
# 1,3,6,9
s3[[21,23,26,29]] # fancy indexing

21    1
23    3
26    6
29    9
dtype: int32

In [26]:
li

[156, 52, 33, 74, 15]

In [27]:
df1 = pd.DataFrame(li)
df1

     0
0  156
1   52
2   33
3   74
4   15

In [28]:
li1 = [[12,23,34],[34,45,46],[67,68,69]]
df2 = pd.DataFrame(li1)
df2

    0   1   2
0  12  23  34
1  34  45  46
2  67  68  69

In [32]:
df2.columns = list("abc") #["a","b","c"]
df2

    a   b   c
0  12  23  34
1  34  45  46
2  67  68  69

In [34]:
df2.columns = [15,16,17]
df2

   15  16  17
0  12  23  34
1  34  45  46
2  67  68  69

In [35]:
di = {
    "a":pd.Series([12,13,14,17],index = [1,2,3,5]),
    "b":pd.Series([12,14,17],index = [1,2,4]),
    "c":pd.Series([14,17,19],index = [2,3,5])
}
df3 = pd.DataFrame(di)
df3

      a     b     c
1  12.0  12.0   NaN
2  13.0  14.0  14.0
3  14.0   NaN  17.0
4   NaN  17.0   NaN
5  17.0   NaN  19.0

In [37]:
d = [{"squares":num**2,"cubes":num**3} for num in range(1,11)]

df4 = pd.DataFrame(d,index = np.arange(21,31))
df4

    cubes  squares
21      1        1
22      8        4
23     27        9
24     64       16
25    125       25
26    216       36
27    343       49
28    512       64
29    729       81
30   1000      100

In [42]:
pd.concat([df4,df4],axis = 1)

    cubes  squares  cubes  squares
21      1        1      1        1
22      8        4      8        4
23     27        9     27        9
24     64       16     64       16
25    125       25    125       25
26    216       36    216       36
27    343       49    343       49
28    512       64    512       64
29    729       81    729       81
30   1000      100   1000      100

In [44]:
df4.append(df4)

    cubes  squares
21      1        1
22      8        4
23     27        9
24     64       16
25    125       25
26    216       36
27    343       49
28    512       64
29    729       81
30   1000      100
21      1        1
22      8        4
23     27        9
24     64       16
25    125       25
26    216       36
27    343       49
28    512       64
29    729       81
30   1000      100

In [45]:
pd.merge(df4,df4)

   cubes  squares
0      1        1
1      8        4
2     27        9
3     64       16
4    125       25
5    216       36
6    343       49
7    512       64
8    729       81
9   1000      100